In [ ]:
import numpy as np
import pandas as pd
from sklearn import preprocessing

# Make a Raw Dataframe

## Create Dataframe

In [ ]:
data = { 
        "column1": [1,2,3,4,5],
        "column2": [21, 22, 23, 24, 25],
        "column3": ['a', 'b', 'c', 'd', 'e']
    }
df = pd.DataFrame(data)
df.head()

   column1  column2 column3
0        1       21       a
1        2       22       b
2        3       23       c
3        4       24       d
4        5       25       e

# Convert categorical column to integer

In [7]:
encoder = preprocessing.LabelEncoder()
encoder.fit(df['column3'])

LabelEncoder()

In [8]:
encoder.classes_

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [9]:
df['column3'] = encoder.transform(df['column3'])

In [10]:
df

   column1  column2  column3
0        1       21        0
1        2       22        1
2        3       23        2
3        4       24        3
4        5       25        4

## Convert it back

In [12]:
encoder.inverse_transform(df['column3'])

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

# Remove non-numeric data

In [13]:
df['column4'] = ['2017-01-01','2017-01-02','2017-01-03','2017-01-04','2017-01-05']
df.head()

   column1  column2  column3     column4
0        1       21        0  2017-01-01
1        2       22        1  2017-01-02
2        3       23        2  2017-01-03
3        4       24        3  2017-01-04
4        5       25        4  2017-01-05

In [16]:
df.select_dtypes([np.number])

   column1  column2  column3
0        1       21        0
1        2       22        1
2        3       23        2
3        4       24        3
4        5       25        4

# Convert dates to numeric offsets

In [17]:
df['column4'] = pd.to_datetime(df['column4'])

In [18]:
df.head(1)

   column1  column2  column3    column4
0        1       21        0 2017-01-01

In [24]:
df['time_offset'] = (df['column4'] - df['column4'].min()) / np.timedelta64(1,'D')
df.head()

   column1  column2  column3    column4  time_offset
0        1       21        0 2017-01-01          0.0
1        2       22        1 2017-01-02          1.0
2        3       23        2 2017-01-03          2.0
3        4       24        3 2017-01-04          3.0
4        5       25        4 2017-01-05          4.0

## Other possibilities instead of 'D' for days:

- 'M' for months
- 'Y' for years
- 'm' for minutes
- 's' for seconds

## Using a particular date as the start date

In [31]:
df['time_offset'] = (df['column4'] - pd.to_datetime('2016-01-01')) / np.timedelta64(1,'D')
df.head()

   column1  column2  column3    column4  time_offset
0        1       21        0 2017-01-01        366.0
1        2       22        1 2017-01-02        367.0
2        3       23        2 2017-01-03        368.0
3        4       24        3 2017-01-04        369.0
4        5       25        4 2017-01-05        370.0

In [29]:
pd.to_datetime('2016-01-01')

Timestamp('2016-01-01 00:00:00')

# Index a dataframe like in regular code

In [32]:
df.iloc[0][0]

1

In [33]:
df.iloc[0][1]

21

In [34]:
df.iloc[1][0]

2

# Insert data into a dataframe

In [36]:
df.iloc[len(df) - 1]

column1                          5
column2                         25
column3                          4
column4        2017-01-05 00:00:00
time_offset                    370
Name: 4, dtype: object

In [67]:
df = df.append(pd.DataFrame({'column1': [6], 'column2': [26]}), ignore_index=True)
df

   column1  column2  column3    column4  time_offset
0      1.0     21.0      0.0 2017-01-01        366.0
1      2.0     22.0      1.0 2017-01-02        367.0
2      3.0     23.0      2.0 2017-01-03        368.0
3      4.0     24.0      3.0 2017-01-04        369.0
4      5.0     25.0      4.0 2017-01-05        370.0
5      6.0     26.0      NaN        NaT          NaN

### Alternatively:

In [ ]:
df = df.set_value(len(df), 'column1', 7)
df

   column1  column2  column3    column4  time_offset
0      1.0     21.0      0.0 2017-01-01        366.0
1      2.0     22.0      1.0 2017-01-02        367.0
2      3.0     23.0      2.0 2017-01-03        368.0
3      4.0     24.0      3.0 2017-01-04        369.0
4      5.0     25.0      4.0 2017-01-05        370.0
5      6.0     26.0      NaN        NaT          NaN
6      7.0      NaN      NaN        NaT          NaN

# Drop rows with NaN

In [71]:
df.dropna()

   column1  column2  column3    column4  time_offset
0      1.0     21.0      0.0 2017-01-01        366.0
1      2.0     22.0      1.0 2017-01-02        367.0
2      3.0     23.0      2.0 2017-01-03        368.0
3      4.0     24.0      3.0 2017-01-04        369.0
4      5.0     25.0      4.0 2017-01-05        370.0

### Drop only rows that have all NaN

In [72]:
df = df.set_value(len(df) - 1, 'column1', np.nan)
df

   column1  column2  column3    column4  time_offset
0      1.0     21.0      0.0 2017-01-01        366.0
1      2.0     22.0      1.0 2017-01-02        367.0
2      3.0     23.0      2.0 2017-01-03        368.0
3      4.0     24.0      3.0 2017-01-04        369.0
4      5.0     25.0      4.0 2017-01-05        370.0
5      6.0     26.0      NaN        NaT          NaN
6      NaN      NaN      NaN        NaT          NaN

In [73]:
df = df.dropna(how='all')

In [74]:
df

   column1  column2  column3    column4  time_offset
0      1.0     21.0      0.0 2017-01-01        366.0
1      2.0     22.0      1.0 2017-01-02        367.0
2      3.0     23.0      2.0 2017-01-03        368.0
3      4.0     24.0      3.0 2017-01-04        369.0
4      5.0     25.0      4.0 2017-01-05        370.0
5      6.0     26.0      NaN        NaT          NaN

# Drop columns

In [76]:
df.drop(['column4', 'column3'], axis=1)

   column1  column2  time_offset
0      1.0     21.0        366.0
1      2.0     22.0        367.0
2      3.0     23.0        368.0
3      4.0     24.0        369.0
4      5.0     25.0        370.0
5      6.0     26.0          NaN

As you can see, axis=1 means column. On the other hand:

In [77]:
df.drop([0], axis=0)

   column1  column2  column3    column4  time_offset
1      2.0     22.0      1.0 2017-01-02        367.0
2      3.0     23.0      2.0 2017-01-03        368.0
3      4.0     24.0      3.0 2017-01-04        369.0
4      5.0     25.0      4.0 2017-01-05        370.0
5      6.0     26.0      NaN        NaT          NaN

In [78]:
df = df.drop(['column4'], axis=1)

In [79]:
df

   column1  column2  column3  time_offset
0      1.0     21.0      0.0        366.0
1      2.0     22.0      1.0        367.0
2      3.0     23.0      2.0        368.0
3      4.0     24.0      3.0        369.0
4      5.0     25.0      4.0        370.0
5      6.0     26.0      NaN          NaN

# Get the mean and standard deviation of a column

In [81]:
df['column1'].mean()

3.5

In [82]:
df['column1'].std()

1.8708286933869707

# Fill NaN's with 0

In [84]:
df.fillna(0)

   column1  column2  column3  time_offset
0      1.0     21.0      0.0        366.0
1      2.0     22.0      1.0        367.0
2      3.0     23.0      2.0        368.0
3      4.0     24.0      3.0        369.0
4      5.0     25.0      4.0        370.0
5      6.0     26.0      0.0          0.0

# Fill NaNs in a column with the column's mean

In [85]:
df['column3'].fillna(df['column3'].mean(), inplace=True)

In [86]:
df

   column1  column2  column3  time_offset
0      1.0     21.0      0.0        366.0
1      2.0     22.0      1.0        367.0
2      3.0     23.0      2.0        368.0
3      4.0     24.0      3.0        369.0
4      5.0     25.0      4.0        370.0
5      6.0     26.0      2.0          NaN

# Normalize a column

## First method: Lambda function

In [97]:
df['column3'].apply(lambda x: (x - df['column3'].mean()) / (df['column3'].max() - df['column3'].min()))

0   -0.50
1   -0.25
2    0.00
3    0.25
4    0.50
5    0.00
Name: column3, dtype: float64

This also works for a whole dataframe:

In [98]:
df.apply(lambda x: (x - x.mean()) / (x.max() - x.min()))

   column1  column2  column3  time_offset
0     -0.5     -0.5    -0.50        -0.50
1     -0.3     -0.3    -0.25        -0.25
2     -0.1     -0.1     0.00         0.00
3      0.1      0.1     0.25         0.25
4      0.3      0.3     0.50         0.50
5      0.5      0.5     0.00          NaN

## Second method: StandardScaler from sklearn

More useful if you need to transform it back later

In [100]:
scaler = preprocessing.StandardScaler()

In [103]:
df[['column3']] = scaler.fit_transform(df[['column3']])

In [104]:
df

   column1  column2   column3  time_offset
0      1.0     21.0 -1.549193        366.0
1      2.0     22.0 -0.774597        367.0
2      3.0     23.0  0.000000        368.0
3      4.0     24.0  0.774597        369.0
4      5.0     25.0  1.549193        370.0
5      6.0     26.0  0.000000          NaN

In [105]:
scaler.inverse_transform(df[['column3']])

array([[ 0.],
       [ 1.],
       [ 2.],
       [ 3.],
       [ 4.],
       [ 2.]])

# Fill NaNs with a value imputed from their k-nn

In [107]:
from fancyimpute import KNN # Note this is a standalone package: pip install fancyimpute

In [111]:
pd.DataFrame(KNN(k=3).complete(df), columns=['column1', 'column2', 'column3', 'time_offset'])

Imputing row 1/6 with 0 missing, elapsed time: 0.001

   column1  column2   column3  time_offset
0      1.0     21.0 -1.549193   366.000000
1      2.0     22.0 -0.774597   367.000000
2      3.0     23.0  0.000000   368.000000
3      4.0     24.0  0.774597   369.000000
4      5.0     25.0  1.549193   370.000000
5      6.0     26.0  0.000000   369.430267

Or, to get the column names automatically:

In [112]:
pd.DataFrame(KNN(k=3).complete(df), columns=df.columns.values)

Imputing row 1/6 with 0 missing, elapsed time: 0.001

   column1  column2   column3  time_offset
0      1.0     21.0 -1.549193   366.000000
1      2.0     22.0 -0.774597   367.000000
2      3.0     23.0  0.000000   368.000000
3      4.0     24.0  0.774597   369.000000
4      5.0     25.0  1.549193   370.000000
5      6.0     26.0  0.000000   369.430267

In fact, you should probably use a list.

In [115]:
pd.DataFrame(KNN(k=3).complete(df), columns=list(df.columns.values))

Imputing row 1/6 with 0 missing, elapsed time: 0.001

   column1  column2   column3  time_offset
0      1.0     21.0 -1.549193   366.000000
1      2.0     22.0 -0.774597   367.000000
2      3.0     23.0  0.000000   368.000000
3      4.0     24.0  0.774597   369.000000
4      5.0     25.0  1.549193   370.000000
5      6.0     26.0  0.000000   369.430267